app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "I am special!"], ["created_at", "2015-01-08 23:43:42.314519"], ["title", "Hello me"], ["updated_at", "2015-01-08 23:43:42.314519"]]

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["image_content_type", "image/jpeg"], ["image_file_name", "logo.jpg"], ["image_file_size", 9089], ["image_updated_at", "2015-01-12 06:24:23.869729"], ["updated_at", "2015-01-12 06:24:23.902140"]]